Revit 2024 API
MEPAnalyticalSegment.SegmentType Property
 The analytical segment type.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public MEPAnalyticalSegmentType SegmentType { get; }
Visual Basic
Public ReadOnly Property SegmentType As MEPAnalyticalSegmentType
	Get
Visual C++
public:
property MEPAnalyticalSegmentType SegmentType {
	MEPAnalyticalSegmentType get ();
}
See Also
MEPAnalyticalSegment Class
Autodesk.Revit.DB.Analysis Namespace